#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.covid_tracker_ui will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "covid_tracker_ui"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::covid-tracker-ui-prod/*",
            ]

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_api_gateway_deployment.covid_tracker must be replaced
+/- resource "aws_api_gateway_deployment" "covid_tracker" {
      ~ created_date  = "2020-10-03T12:02:24Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-southeast-1:780046271874:hvw6yag8n9/prod" -> (known after apply)
      ~ id            = "bhkyjj" -> (known after apply)
      ~ invoke_url    = "https://hvw6yag8n9.execute-api.ap-southeast-1.amazonaws.com/prod" -> (known after apply)
        rest_api_id   = "hvw6yag8n9"
        stage_name    = "prod"
      ~ variables     = { # forces replacement
          ~ "trigger" = "24f1cbe72e03595de6d91880fe764155" -> "17089460f6fa889f481af37b7c83ea77"
        }
    }

  # aws_api_gateway_integration.cors_integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "cors_integration" {
        cache_key_parameters = []
        cache_namespace      = "dsaox9"
        connection_type      = "INTERNET"
        http_method          = "OPTIONS"
        id                   = "agi-hvw6yag8n9-dsaox9-OPTIONS"
        passthrough_behavior = "WHEN_NO_MATCH"
        request_parameters   = {}
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        resource_id          = "dsaox9"
        rest_api_id          = "hvw6yag8n9"
        timeout_milliseconds = 29000
        type                 = "MOCK"
    }

  # aws_api_gateway_integration.test will be updated in-place
  ~ resource "aws_api_gateway_integration" "test" {
        cache_key_parameters = []
        cache_namespace      = "iybr64"
        connection_type      = "INTERNET"
        http_method          = "POST"
        id                   = "agi-hvw6yag8n9-iybr64-POST"
        passthrough_behavior = "WHEN_NO_MATCH"
        request_parameters   = {}
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    body       = {
                        covidId = 500
                    }
                    statusCode = 200
                }
            )
        }
        resource_id          = "iybr64"
        rest_api_id          = "hvw6yag8n9"
        timeout_milliseconds = 29000
        type                 = "MOCK"
    }

  # aws_appsync_graphql_api.covidtracker will be updated in-place
  ~ resource "aws_appsync_graphql_api" "covidtracker" {
        arn                 = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne"
        authentication_type = "API_KEY"
        id                  = "yb5auvtbovb6rkgedsrn3jrvne"
        name                = "covidtracker-graphql"
      ~ schema              = <<~EOT
            schema {
                query: Query
            }
            
            type Query {
            
              cases(
                # Region of the case
                region: String,
                # Province of the case
                province: String,
                # City of the case
                city: String,
                # Pagination offset
                offset: Int,
                # Pagination limit
                limit: Int
              ): [Case!]
            
              case(caseNo: String!): Case
            
              ageGenderDistribution(
                # Type of the case
                type: Type!
              ): [AgeGenderDistribution!]
            
              accumulation(
                # Type of the case
                type: Type!
              ): [Accumulation!]
            
              statistics(
                # Region of the case
                region: String,
                # Province of the case
                province: String,
                # City of the case
                city: String
              ): CaseStatistic
            
              region(
                # Search query
                query: String
              ): [SelectionItem]
            
              province(
                # Search query
                query: String,
                # Region of the province
                region: String
              ): [SelectionItem]
            
              city(
                # Search query
                query: String,
                # Province of the city
                province: String,
                # Region of the city
                region: String
              ): [SelectionItem]
              
              dailyStatistic(
                # Type of the case
                type: Type!,
                # Region of the case  
                region: String,
                # Province of the case
                province: String,
                # City of the case
                city: String
              ): [DailyStatistic!]
            
              locationStatistic(
                # Location Type
                type: LocationType!,
                # Keyword to search for
                search: String,
                # Location type to search against
                searchType: LocationType
              ): [LocationStatistic!]
            }
            
            type Accumulation {
              # Field accumulated against
              accumulator: AWSDateTime
            
              # Total value of the accumulation
              value: Int
            }
            
            type DailyStatistic {
              # Date
              date: AWSDateTime
            
              # Total value of the date
              value: Int
            }
            
            input AccumulationInput {
              # Type of the case
              type: Type!
            }
            
            # Case distribution by age and gender
            type AgeGenderDistribution {
              # Age group
              ageGroup: String
            
              # Gender
              sex: String
            
              # Total value of distribution
              value: Int
            }
            
            # A COVID19 case
            type Case {
              # Case number assigned by DOH
              caseNo: String!
            
              # Age of the case patient
              age: Int
            
              # Age group of the case patient
              ageGroup: String
            
              # Date of disease confirmation
              dateConfirmed: AWSDateTime
            
              # Date of disease recovery
              dateRecovered: AWSDateTime
            
              # Date of death
              dateDied: AWSDateTime
            
              # Type of removal. Recovered or Died
              removalType: String
            
              # Date of removal
              dateRemoved: AWSDateTime
            
              # Person was admitted to a health facility
              admitted: Boolean
            
              # Health status of person
              healthStatus: String
            
              # Region of residence
              region: String
            
              # Province of residence
              province: String
            
              # City of residence
              city: String
            
              # Date of entity insertion
              insertedAt: AWSDateTime
            
              # Date of entity modification
              updatedAt: AWSDateTime
            }
            
            # COVID19 case statistics
            type CaseStatistic {
              # Total confirmed cases
              total: Int
            
              # New confirmed cases
              new: Int
            
              # Number of cases marked dead
              dead: Int
            
              # New cases marked dead
              deadNew: Int
            
              # Number of cases marked recovered
              recovered: Int
            
              # New cases marked recovered
              recoveredNew: Int
            
              # Number of cases marked admitted and have not died or recovered
              admitted: Int
            
              # New cases marked admitted and have not died or recovered
              admittedNew: Int
            
              # Number of cases that have not died or recovered
              active: Int
            
              # New cases that have not died or recovered
              activeNew: Int
            }
            
            # Selection item for user interface
            type SelectionItem {
              # User interface display
              display: String
            
              # Actual value
              value: String
            }
            
            
            type LocationStatistic {
              # Name of the location
              name: String
            
              # Total confirmed cases
              total: Int
            
              # New confirmed cases
              new: Int
            
              # Number of cases marked dead
              dead: Int
            
              # New cases marked dead
              deadNew: Int
            
              # Number of cases marked recovered
              recovered: Int
            
              # New cases marked recovered
              recoveredNew: Int
            
              # Number of cases marked admitted and have not died or recovered
              admitted: Int
            
              # New cases marked admitted and have not died or recovered
              admittedNew: Int
            
              # Number of cases that have not died or recovered
              active: Int
            
              # New cases that have not died or recovered
              activeNew: Int
            }
            
            scalar AWSDateTime
            
            # Type of the case
            enum Type {
              TOTAL
              ADMITTED
              DIED
              RECOVERED
              ACTIVE
            }
            
            
            # Type of the location
            enum LocationType {
              REGION
              PROVINCE
              CITY
            }
        EOT
        tags                = {}
        uris                = {
            "GRAPHQL"  = "https://qbqrlzgkwjfmvmugfdzy4bbt3y.appsync-api.ap-southeast-1.amazonaws.com/graphql"
            "REALTIME" = "wss://qbqrlzgkwjfmvmugfdzy4bbt3y.appsync-realtime-api.ap-southeast-1.amazonaws.com/graphql"
        }
        xray_enabled        = false
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
        aliases                        = [
            "covidtracker.ph",
            "trackncovph.jclarino.com",
        ]
        arn                            = "arn:aws:cloudfront::780046271874:distribution/E1FQR0D7SQEOUW"
        caller_reference               = "terraform-20200513204351306500000001"
        comment                        = "Covid Tracker PH UI"
        domain_name                    = "d5vilgk0i4k76.cloudfront.net"
        enabled                        = true
        etag                           = "E1WDMB0SIIP5YT"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E1FQR0D7SQEOUW"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2020-10-03 12:02:38.73 +0000 UTC"
        price_class                    = "PriceClass_100"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {
            "Environment" = "production"
        }
        wait_for_deployment            = true

        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 400
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 403
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 404
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 500
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 501
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 502
            response_code         = 0
        }
        custom_error_response {
            error_caching_min_ttl = 0
            error_code            = 503
            response_code         = 0
        }

      ~ default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3-covid-tracker-ui-prod"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }

          - lambda_function_association {
              - event_type   = "origin-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod:3" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
          - lambda_function_association {
              - event_type   = "origin-response" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:780046271874:function:guest-token-inserter-prod:9" -> null
            }
          + lambda_function_association {
              + event_type   = "origin-response"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }

        origin {
            domain_name = "covid-tracker-ui-prod.s3.ap-southeast-1.amazonaws.com"
            origin_id   = "S3-covid-tracker-ui-prod"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/EOLN20WS2FPT5"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

        viewer_certificate {
            acm_certificate_arn            = "arn:aws:acm:us-east-1:780046271874:certificate/825ca9a3-c78c-4a71-af9c-7595f9550dbb"
            cloudfront_default_certificate = false
            minimum_protocol_version       = "TLSv1.1_2016"
            ssl_support_method             = "sni-only"
        }
    }

  # aws_db_instance.covid_rds will be updated in-place
  ~ resource "aws_db_instance" "covid_rds" {
        address                               = "covid-rds.cfduhmtpih7j.ap-southeast-1.rds.amazonaws.com"
        allocated_storage                     = 5
        arn                                   = "arn:aws:rds:ap-southeast-1:780046271874:db:covid-rds"
        auto_minor_version_upgrade            = true
        availability_zone                     = "ap-southeast-1a"
        backup_retention_period               = 0
        backup_window                         = "15:15-15:45"
        ca_cert_identifier                    = "rds-ca-2019"
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "default"
        delete_automated_backups              = true
        deletion_protection                   = false
        enabled_cloudwatch_logs_exports       = []
        endpoint                              = "covid-rds.cfduhmtpih7j.ap-southeast-1.rds.amazonaws.com:5432"
        engine                                = "postgres"
      ~ engine_version                        = "10.15" -> "10.6"
        hosted_zone_id                        = "Z2G0U3KFCY8NZ5"
        iam_database_authentication_enabled   = false
        id                                    = "covid-rds"
        identifier                            = "covid-rds"
        instance_class                        = "db.t2.micro"
        iops                                  = 0
        license_model                         = "postgresql-license"
        maintenance_window                    = "tue:19:38-tue:20:08"
        max_allocated_storage                 = 0
        monitoring_interval                   = 0
        multi_az                              = false
        option_group_name                     = "default:postgres-10"
        parameter_group_name                  = "default.postgres10"
        password                              = (sensitive value)
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 5432
        publicly_accessible                   = true
        replicas                              = []
        resource_id                           = "db-GMKTCWMSIRPU6OQGRRGFQW3HWA"
        security_group_names                  = []
        skip_final_snapshot                   = true
        status                                = "available"
        storage_encrypted                     = false
        storage_type                          = "gp2"
        tags                                  = {}
        username                              = "covid_rds"
        vpc_security_group_ids                = [
            "sg-0f94c2bdadf6dbaeb",
        ]
    }

  # aws_lambda_function.case_collection will be updated in-place
  ~ resource "aws_lambda_function" "case_collection" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:case-collection"
        filename                       = "./lambda_functions/case-collection/function.zip"
        function_name                  = "case-collection"
        handler                        = "CaseCollection::CaseCollection.LambdaEntry::RunAsync"
        id                             = "case-collection"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:case-collection/invocations"
      ~ last_modified                  = "2020-10-03T14:06:07.390+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 512
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:case-collection:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/case-collection"
        runtime                        = "dotnetcore3.1"
      ~ source_code_hash               = "X7GURAlOgfO/dKFH/pEC1yOvPjNsMiOuqlPi9wU4SCA=" -> "+VOCUUsns9hc6O0jEBjdH208jFIvfuvP9Haxq7nFHnk="
        source_code_size               = 3895353
        tags                           = {}
        timeout                        = 900
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "DRIVE_CONFIG_SECRET_ID"               = "googleaccesskey"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.google_verification will be updated in-place
  ~ resource "aws_lambda_function" "google_verification" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:google-verification"
        filename                       = "./lambda_functions/google-verification/function.zip"
        function_name                  = "google-verification"
        handler                        = "index.handler"
        id                             = "google-verification"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:google-verification/invocations"
      ~ last_modified                  = "2020-10-03T12:02:43.858+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:google-verification:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/google-verification"
        runtime                        = "nodejs10.x"
      ~ source_code_hash               = "acaKvK0UQIdEU0+w/srjSvRjFptyWdGrC09D++2WNu8=" -> "3pk7AemI084Rz1Dyf8vlps+/3dGfl5yh/Cad3xnir+c="
        source_code_size               = 2401
        tags                           = {}
        timeout                        = 15
        version                        = "$LATEST"

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.graph will be updated in-place
  ~ resource "aws_lambda_function" "graph" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph"
        filename                       = "./lambda_functions/graph-node/function.zip"
        function_name                  = "graph"
        handler                        = "index.handler"
        id                             = "graph"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:graph/invocations"
      ~ last_modified                  = "2020-10-03T15:18:35.136+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 256
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/graph"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "JYqtvb6JvP6zWFrVil9fDiN0tE6T3NT6WcAiv7oExVY=" -> "wwQv0zCojx1iYYAE/baPSpJbI8m+9DOvgOS4TUpScJk="
        source_code_size               = 1698651
        tags                           = {}
        timeout                        = 30
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.graph_resolver will be updated in-place
  ~ resource "aws_lambda_function" "graph_resolver" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver"
        filename                       = "./lambda_functions/graph-resolver/function.zip"
        function_name                  = "graph-resolver"
        handler                        = "index.handler"
        id                             = "graph-resolver"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver/invocations"
      ~ last_modified                  = "2020-10-03T15:45:53.935+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 256
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/graph-resolver"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "R8bjTDhiCvU4PmsFbRvLlHD1BaERC/UMmPP+Pk6HOiw=" -> "OrA58wCvAM9uv8qwJpGDbhDStoPvQBxYDqT9aVG6ooc="
        source_code_size               = 1085026
        tags                           = {}
        timeout                        = 30
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.guest_token_inserter will be updated in-place
  ~ resource "aws_lambda_function" "guest_token_inserter" {
        arn                            = "arn:aws:lambda:us-east-1:780046271874:function:guest-token-inserter-prod"
        filename                       = "./lambda_functions/ui-guest-token/function.zip"
        function_name                  = "guest-token-inserter-prod"
        handler                        = "index.handler"
        id                             = "guest-token-inserter-prod"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:780046271874:function:guest-token-inserter-prod/invocations"
      ~ last_modified                  = "2020-10-03T12:02:32.557+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = true
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:780046271874:function:guest-token-inserter-prod:9" -> (known after apply)
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/guest-token-inserter-lambda"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "tkBfb86kywmOdqey5wWzGnFmkFKCGN8K0DVybQU4N4c=" -> "Uc3nhabxtkDqLXcAB+YQvzqMoDnSUQCVqNp4+4ntLGk="
        source_code_size               = 3074
        tags                           = {}
        timeout                        = 5
      ~ version                        = "9" -> (known after apply)

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_lambda_function.static_ui_path_rewrite will be updated in-place
  ~ resource "aws_lambda_function" "static_ui_path_rewrite" {
        arn                            = "arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod"
        filename                       = "./lambda_functions/ui-path-rewrite/function.zip"
        function_name                  = "static-ui-path-rewrite-prod"
        handler                        = "index.handler"
        id                             = "static-ui-path-rewrite-prod"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod/invocations"
      ~ last_modified                  = "2020-10-03T12:02:27.290+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = true
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:780046271874:function:static-ui-path-rewrite-prod:3" -> (known after apply)
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/static-ui-path-rewrite-lambda"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "/ybIsEtezY3dmRb7Z6x5wo0SO3A9MabvEU2Yee57Fbk=" -> "x69KQnZRczqD4maKBqjXAleXC0ff85BKsyQGIfMuow8="
        source_code_size               = 69224
        tags                           = {}
        timeout                        = 5
      ~ version                        = "3" -> (known after apply)

        tracing_config {
            mode = "PassThrough"
        }
    }

  # aws_s3_bucket.covid_tracker_ui will be updated in-place
  ~ resource "aws_s3_bucket" "covid_tracker_ui" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::covid-tracker-ui-prod"
        bucket                      = "covid-tracker-ui-prod"
        bucket_domain_name          = "covid-tracker-ui-prod.s3.amazonaws.com"
        bucket_regional_domain_name = "covid-tracker-ui-prod.s3.ap-southeast-1.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3O0J2DXBE1FTB"
        id                          = "covid-tracker-ui-prod"
      ~ region                      = "ap-southeast-1" -> "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Name" = "covid-tracker-ui-prod"
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # aws_s3_bucket_policy.static_uis will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_uis" {
        bucket = "covid-tracker-ui-prod"
        id     = "covid-tracker-ui-prod"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5"
                        }
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOLN20WS2FPT5"
                        }
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::covid-tracker-ui-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["accumulation"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/accumulation"
        data_source       = "covidtracker_graph_datasource"
        field             = "accumulation"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-accumulation"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "accumulation",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["ageGenderDistribution"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/ageGenderDistribution"
        data_source       = "covidtracker_graph_datasource"
        field             = "ageGenderDistribution"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-ageGenderDistribution"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "ageGenderDistribution",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["case"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/case"
        data_source       = "covidtracker_graph_datasource"
        field             = "case"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-case"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "case",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["cases"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/cases"
        data_source       = "covidtracker_graph_datasource"
        field             = "cases"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-cases"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "cases",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["city"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/city"
        data_source       = "covidtracker_graph_datasource"
        field             = "city"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-city"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "city",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["dailyStatistic"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/dailyStatistic"
        data_source       = "covidtracker_graph_datasource"
        field             = "dailyStatistic"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-dailyStatistic"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "dailyStatistic",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["locationStatistic"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/locationStatistic"
        data_source       = "covidtracker_graph_datasource"
        field             = "locationStatistic"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-locationStatistic"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "locationStatistic",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["province"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/province"
        data_source       = "covidtracker_graph_datasource"
        field             = "province"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-province"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "province",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["region"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/region"
        data_source       = "covidtracker_graph_datasource"
        field             = "region"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-region"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "region",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["statistics"] will be updated in-place
  ~ resource "aws_appsync_resolver" "query_resolver" {
        api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
        arn               = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne/types/Query/resolvers/statistics"
        data_source       = "covidtracker_graph_datasource"
        field             = "statistics"
        id                = "yb5auvtbovb6rkgedsrn3jrvne-Query-statistics"
        kind              = "UNIT"
      ~ request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "statistics",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
        response_template = "$utils.toJson($context.result)"
        type              = "Query"
    }

Plan: 1 to add, 23 to change, 1 to destroy.
```

</details>

*Workflow: `Infra Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `core`, Workspace: `default`*
